# CreateSheetLayerPullDownMenu

## Description
Creates a Layout Manager sheet layer pull down menu control.

```pascal
PROCEDURE CreateSheetLayerPullDownMenu(
				nDialogID      : LONGINT;
				nComponentID   : LONGINT;
				widthInStdChar : INTEGER);
```

```python

def vs.CreateSheetLayerPullDownMenu(nDialogID, nComponentID, widthInStdChar):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|nDialogID|LONGINT||
|nComponentID|LONGINT||
|widthInStdChar|INTEGER|The width of the displayed text in standard character count. See GetDlgCtrlWidthStdCh.|

## See Also
VS Functions:
GetDlgCtrlWidthStdCh

## Version
Availability: from VectorWorks 2008
## Category
* Dialogs - Modern